package com.zy.dubbo;

public enum DrivingEnum {
    /**
     * 1、请打开近光灯	近光灯
     * 2、夜间同方向近距离跟车行驶	近光灯
     * 3、夜间与机动车会车	近光灯
     * 4、夜间直行通过路口	近光灯
     * 5、夜间在窄路与非机动车会车	近光灯
     * 6、夜间在照明良好的道路上行驶	近光灯
     * 7、夜间在窄桥与非机动车会车	近光灯
     * 8、夜间在有路灯的道路上行驶	近光灯
     * 9、夜间路口左转弯	近光灯+左转向灯
     * 10、夜间路口右转弯	近光灯+右转向灯
     * 11、请打开远光灯	远光灯
     * 12、夜间在没有路灯，照明不良条件下行驶	远光灯
     * 13、夜间通过急弯、坡路	交替使用远近光灯
     * 14、夜间通过坡路、拱桥	交替使用远近光灯
     * 15、夜间通过急弯、拱桥	交替使用远近光灯
     * 16、夜间通过拱桥、人行横道	交替使用远近光灯
     * 17、夜间通过没有交通信号灯控制的路口	交替使用远近光灯
     * 18、夜间超越前方车辆	交替使用远近光灯
     * 19、路边临时停车	危险报警闪关灯+示廓灯(属称小灯)
     * 20、雾天行驶	雾灯+危险报警闪光灯
     */
}
